---
title: LevelAssociationData
classe: Autodesk.Revit.DB.LevelAssociationData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# LevelAssociationData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `levelAssociationData.IsValidObject` | Boolean |
| `Void Dispose()` | `levelAssociationData.Dispose()` | Void |
| `ElementId GetAssociatedLevel()` | `levelAssociationData.GetAssociatedLevel()` | ElementId |
| `LevelAssociationData GetLevelAssociationData(Element)` | `LevelAssociationData.GetLevelAssociationData(element)` | LevelAssociationData |
| `Double GetLevelOffset()` | `levelAssociationData.GetLevelOffset()` | Double |
| `Void SetAssociatedLevel(ElementId)` | `levelAssociationData.SetAssociatedLevel(levelId)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```